УТ_для_edt.РасширениеСмарт/src/Reports/КонтрольОформленияДокументовТовародвижений/КонтрольОформленияДокументовТовародвижений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b0e399a9-5b21-4a44-bfe5-8686d1484623">
  <name>КонтрольОформленияДокументовТовародвижений</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Reports/КонтрольОформленияДокументовТовародвижений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

//++ #Б-1872 смарт: Лопато 05.02.2025 //Привязать корректировку реализации к заявке на возврат  
&ИзменениеИКонтроль("ТекстЗапросаВозвратыТоваровОтКлиентов")
Функция смарт_ТекстЗапросаВозвратыТоваровОтКлиентов()
	
	// Строковые литералы локализуются в настройках СКД отчета
	// Наборы данных - Поля - Доступные значения.
	
	#Удаление //#Б-1872 смарт: Лопато 05.02.2025 //Привязать корректировку реализации к заявке на возврат  
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&СтрокаВидОперацииВозвратыТоваровОтКлиентов КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|			ТОГДА &СтрокаТипОтклоненияОформлениеФинансовыхДокументов
	|		ИНАЧЕ &СтрокаТипОтклоненияОформлениеСкладскихДокументов
	|	КОНЕЦ КАК ТипОтклонения,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|			ТОГДА &СтрокаРекомендацияОформитеВозвратТоваровОтКлиента
	|		ИНАЧЕ &СтрокаРекомендацияОформитеПриходныеОрдераНаТовары
	|	КОНЕЦ КАК Рекомендация,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток
	|	КОНЕЦ КАК НезавершеннаяСкладскаяОперация,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|			ТОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НезавершеннаяФинансоваяОперация,
	|	ЕСТЬNULL(РеквизитыРаспоряжения.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК ДатаОперации,
	|	ТоварыКОформлениюПоступления.ДокументПоступления КАК Распоряжение,
	|	ТоварыКОформлениюПоступления.Склад КАК Склад,
	|	ТоварыКОформлениюПоступления.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюПоступления.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюПоступления.Серия КАК Серия,
	|	ТоварыКОформлениюПоступления.Назначение КАК Назначение
	|{ВЫБРАТЬ
	|	Склад.*,
	|	Номенклатура.*,
	|	Характеристика.*,
	|	Серия.*,
	|	Назначение.*}
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|		&ПериодГраница,
	|		ТИПЗНАЧЕНИЯ(ДокументПоступления) В(ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента),
	|											ТИП(Документ.ВозвратТоваровОтКлиента))
	|		И &ОтборТоваровПоРегистру
	|		{(ДокументПоступления).* КАК Распоряжение, (Склад).*, (Номенклатура).*, (Характеристика).*, (Серия).*, (Назначение).*}
	|	
	|	) КАК ТоварыКОформлениюПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыРаспоряжения
	|		ПО ТоварыКОформлениюПоступления.ДокументПоступления = РеквизитыРаспоряжения.Ссылка
	|			И НЕ РеквизитыРаспоряжения.ДополнительнаяЗапись
	|
	|{ГДЕ
	|	(&СтрокаВидОперацииВозвратыТоваровОтКлиентов) КАК ВидОперации,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|				ТОГДА &СтрокаТипОтклоненияОформлениеФинансовыхДокументов
	|			ИНАЧЕ &СтрокаТипОтклоненияОформлениеСкладскихДокументов
	|		КОНЕЦ) КАК ТипОтклонения,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|				ТОГДА &СтрокаРекомендацияОформитеВозвратТоваровОтКлиента
	|			ИНАЧЕ &СтрокаРекомендацияОформитеПриходныеОрдераНаТовары
	|		КОНЕЦ) КАК Рекомендация,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|				ТОГДА 0
	|			ИНАЧЕ -ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток
	|		КОНЕЦ) КАК НезавершеннаяСкладскаяОперация,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток > 0
	|				ТОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НезавершеннаяФинансоваяОперация}";
	#КонецУдаления
	
	#Вставка
	//++ #Б-1872 смарт: Лопато 05.02.2025 //Привязать корректировку реализации к заявке на возврат  
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&СтрокаВидОперацииВозвратыТоваровОтКлиентов КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|			ТОГДА &СтрокаТипОтклоненияОформлениеФинансовыхДокументов
	|		ИНАЧЕ &СтрокаТипОтклоненияОформлениеСкладскихДокументов
	|	КОНЕЦ КАК ТипОтклонения,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|			ТОГДА ""Оформите корректировку реализации""
	|		ИНАЧЕ &СтрокаРекомендацияОформитеПриходныеОрдераНаТовары
	|	КОНЕЦ КАК Рекомендация,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток
	|	КОНЕЦ КАК НезавершеннаяСкладскаяОперация,
	|	ВЫБОР
	|		КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|			ТОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НезавершеннаяФинансоваяОперация,
	|	ЕСТЬNULL(РеквизитыРаспоряжения.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК ДатаОперации,
	|	ТоварыКОформлениюПоступления.ДокументПоступления КАК Распоряжение,
	|	ТоварыКОформлениюПоступления.Склад КАК Склад,
	|	ТоварыКОформлениюПоступления.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюПоступления.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюПоступления.Серия КАК Серия,
	|	ТоварыКОформлениюПоступления.Назначение КАК Назначение
	|{ВЫБРАТЬ
	|	Склад.*,
	|	Номенклатура.*,
	|	Характеристика.*,
	|	Серия.*,
	|	Назначение.*}
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|		&ПериодГраница,
	|		ТИПЗНАЧЕНИЯ(ДокументПоступления) В(ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента),
	|											ТИП(Документ.ВозвратТоваровОтКлиента))
	|		И &ОтборТоваровПоРегистру
	|		{(ДокументПоступления).* КАК Распоряжение, (Склад).*, (Номенклатура).*, (Характеристика).*, (Серия).*, (Назначение).*}
	|	
	|	) КАК ТоварыКОформлениюПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыРаспоряжения
	|		ПО ТоварыКОформлениюПоступления.ДокументПоступления = РеквизитыРаспоряжения.Ссылка
	|			И НЕ РеквизитыРаспоряжения.ДополнительнаяЗапись
	|ГДЕ
	|	ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|	ИЛИ ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток < 0
    |
	|{ГДЕ
	|	(&СтрокаВидОперацииВозвратыТоваровОтКлиентов) КАК ВидОперации,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|				ТОГДА &СтрокаТипОтклоненияОформлениеФинансовыхДокументов
	|			ИНАЧЕ &СтрокаТипОтклоненияОформлениеСкладскихДокументов
	|		КОНЕЦ) КАК ТипОтклонения,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|				ТОГДА &СтрокаРекомендацияОформитеВозвратТоваровОтКлиента
	|			ИНАЧЕ &СтрокаРекомендацияОформитеПриходныеОрдераНаТовары
	|		КОНЕЦ) КАК Рекомендация,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток < 0
	|				ТОГДА 0
	|			ИНАЧЕ -ТоварыКОформлениюПоступления.КОформлениюПоступленийПоОрдерамОстаток
	|		КОНЕЦ) КАК НезавершеннаяСкладскаяОперация,
	|	(ВЫБОР
	|			КОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток > 0
	|				ТОГДА ТоварыКОформлениюПоступления.КОформлениюНакладныхПоРаспоряжениюОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НезавершеннаяФинансоваяОперация}";
	//-- #Б-1872 смарт: Лопато 05.02.2025
	#КонецВставки
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
